{
    "Text language model": [
        "Instruction: We're trying to identify similar user comments on a blog post. Can you help us work out the embeddings for a list of comments?",
        "Instruction: Identify the stock prices of tech companies, based on the given news article. First, create embeddings for each article text.",
        "Instruction: Find a concise way to represent an article headline for data clustering purposes.",
        "Instruction: Recently, our company received some text reviews from customers. We need to create a summary for a meeting.",
        "Instruction: Our management has asked to analyze news articles for market analysis. Transform these news article's headlines into numerical vectors.",
        "Instruction: I'm working on a comment similarity project, and I need a pre-trained text language model to generate embeddings for given sentences.",
        "Instruction: Summarize a few articles and compare their meanings.",
        "Instruction: Identify similarities between headlines from different news sources and group them together.\n",
        "Instruction: Please assist me in finding the right pre-trained model to transform the following sentences into corresponding vectors: \"The sky is blue\" and \"Paris is a beautiful city\"."
    ],
    "Text classification": [
        "Instruction: I am currently working with a dataset of news articles, and I want to develop a classification model to categorize these articles.",
        "Instruction: Can you enhance our chatbot so that it understands what the user is saying by converting the sentences into high-dimensional vectors?",
        "Instruction: We want to classify news articles. Load the pre-trained model for text classification.",
        "Instruction: I have a list of tweets, and I want to group them by topic.",
        "Instruction: I'm thinking about downloading some articles from a news website, and I want them to be clustered into different groups like sports, business, and technology.",
        "Instruction: We need to classify a set of news articles, please load a news classifier model.",
        "Instruction: In order to guess the emotional status, we would like to know which sentiments are more associated with a tweet. So, we need to process the tweet and convert it into a suitable format.",
        "Instruction: Can you help me with a model that can approximately distinguish between words related to flowers and words related to cars?",
        "Instruction: Can you recommend a ready-to-use model that will help me find similar questions in a large database of questions?",
        "Instruction: We are building a text editor, and we need to classify user texts based on their news article category.",
        "Instruction: For a spam detection system, we would like to extract a vector representation of email subjects.",
        "Instruction: To take a look at the sentiment towards a newly launched product on social media, extract useful information from user comments.",
        "Instruction: Tell me which language these words (\"casa\", \"chat\", \"croissant\") are most likely to come from, based on their embeddings.",
        "Instruction: Our team develop a news classification tool. Load the appropriate model for getting word embeddings.\n",
        "Instruction: I have a set of news articles and I need to classify them into different categories based on their content.",
        "Instruction: You need to classify news articles into various categories. Load a pre-trained text classification model that can help in this task."
    ],
    "Image segmentation": [
        "Instruction: I am interested in analyzing satellite images and mapping land-use types. Can you recommend a tool for splitting my images into meaningful sections?\n",
        "Instruction: Implement a mechanism to find areas of potential interest in an area surrounded by a barricade for an upcoming event.",
        "Instruction: I want to separate the background from the foreground in an image of a person so that I can change the background later.",
        "Instruction: Can you help me identify and separate different objects in an image? I need to highlight objects more clearly.",
        "Instruction: We would like to visually separate the main characters in 3 central areas during our theater performances. How can we assign a label to every pixel in a picture?",
        "Instruction: We are working on a project that requires to separate the object from the background in an image. Please achieve this by leveraging an image segmentation API.",
        "Instruction: Suppose we have an aerial image of a city, and I want to differentiate various objects like vehicles, roads, and buildings in it.",
        "Instruction: I have drone images of farmland and I need to segment crops and find areas with water stress. Generate a model for image segmentation.",
        "Instruction: Analyze a landscape image and filter out distinct segments of the image, like trees, water, and sky.",
        "Instruction: Suppose I took a picture of my park, and I want my phone to tell me how many dogs are in the picture.",
        "Instruction: We have a collection of satellite images of various agricultural lands, and we need to identify different crop types grown on them.",
        "Instruction: We have drone images of a farm, and I want to generate a segmented map showing different regions like fields, water bodies, and buildings.",
        "Instruction: We are building an app for a waste separation company, and we need a system to segment waste on the conveyor belt to separate organic and inorganic waste.",
        "Instruction: For our AI-powered graffiti removal project, help us identify and segment areas of graffiti on a building's walls.",
        "Instruction: There's an image dataset containing drones, and I need to identify their boundaries in the images. So I want to use image segmentation models to detect them.",
        "Instruction: For an upcoming design project, I need to isolate individual objects in images. Can you help me with that?",
        "Instruction: We would like to separate different objects in an image for further processing.",
        "Instruction: Analyze an image of a city to determine the different regions, such as roads, buildings, parks, and water bodies.",
        "Instruction: Generate segmented images of objects within a given image so that background can be removed.",
        "Instruction: I am trying to build a cityscape annotation tool where roads, buildings, cars, and pedestrians are highlighted in different colors.",
        "Instruction: An airport traffic control system requires rapid image segmentation to identify different parts of airplanes quickly when analyzing camera footage.",
        "Instruction: I have a collection of photos that I want to automatically remove the background from. What model should I use?",
        "Instruction: Trying to do some image editing by seperating background and object. Go ahead and help me in that.",
        "Instruction: Can you tell me how to remove the background of an image?",
        "Instruction: Implement a traffic monitoring system that detects cars, pedestrians and road signs in real-time using images.",
        "Instruction: To understand more about the environment, I want to segment areas of interest in satellite images.",
        "Instruction: Identify distinguishable regions in a picture of a busy city street.",
        "Instruction: We are working on a project that requires us to separate different objects in an image effectively.",
        "Instruction: Let's analyze an image of a street and identify different objects by segmenting it into meaningful regions.",
        "Instruction: Identify and separate different objects in an image.",
        "Instruction: Let's segment different objects in an image to help visually impaired people understand it.",
        "Instruction: A city planning committee is requesting an analysis of several aerial images to identify streets, buildings, and vegetation. Help them by segmenting these images.",
        "Instruction: I am doing a project on urban planning and I need to identify and label different objects, such as buildings, roads, and trees in satellite images.",
        "Instruction: I have images of various cars, and I need to identify the boundaries of each car in the image.",
        "Instruction: Our advertisement company wants to build a tool that can identify and remove the background in ads' images, so they can put new backgrounds according to the scenario.",
        "Instruction: Segment various objects in an image by extracting their individual pixels.",
        "Instruction: The city council wants to analyze satellite images of the city to determine the percentage of green spaces. They need a way to separate green spaces from other areas in the images.",
        "Instruction: I need to segment an image of a street containing cars, people and trees to identify the different objects in it.",
        "Instruction: I would like to segment a collection of images featuring various streetscapes into their respective components such as buildings, vehicles, and pedestrians.",
        "Instruction: I have a picture of a crowd of people and I want to highlight every individual by outlining their borders.",
        "Instruction: It's not easy to differentiate between foreground and background in our image. Help us assign semantic labels to every pixel of our input image.",
        "Instruction: Can you tell me which is the best API to detect and separate objects in a given image?",
        "Instruction: I am working on a robotics project, and I need to separate the objects from the background in the images my robot captures.",
        "Instruction: We are looking to add an image of a person to an ad we are making, we need to isolate the person from any background. ",
        "Instruction: Segregate the objects in a given image into their respective groups.",
        "Instruction: I want to recognize my friends in my group photo which also includes a few trees and a park behind them, now how can I? I need to find which portion of the image represents my friends.",
        "Instruction: I have an image of a street scene and I want to segment the image into different object classes.",
        "Instruction: Our team is working on road construction, and we need to segment the different objects in a given construction site image.",
        "Instruction: I have taken a picture of my living room and I want to separate different objects and their background.",
        "Instruction: Our park is getting too crowded, could you help me separate the people from the background in the images we took?",
        "Instruction: Our company is developing a software that can differentiate between road, vehicles, and buildings in images. Can you help us to segment these images?",
        "Instruction: I need to segment a photo taken during a football match to study the players' positions.",
        "Instruction: I have an image of a crowded street, and I want to identify the number of pedestrians in the image.",
        "Instruction: I took a photo of a jigsaw puzzle, but I need help in identifying the different objects present in the image so I can assemble it properly.",
        "Instruction: Jenny is taking a photography class, and she's trying to count the number of people in a photo at a city park. Help her by segmenting the photo into parts.",
        "Instruction: Recognize the objects and their boundaries in the given image and label each pixel accordingly.",
        "Instruction: Isolate the objects in the image by assigning each pixel the most likely category (background, person, car, etc.).",
        "Instruction: How can I understand the distribution of objects in a nature scene by analyzing a photograph?",
        "Instruction: Can you help me to separate out road, sky, trees and vehicles in an image by segmenting it?",
        "Instruction: What animal is in this picture? Create a segmentation mask to highlight the animal.",
        "Instruction: We want to differentiate between apples and oranges in photos. Segment the input image to identify different objects.",
        "Instruction: I want to save space in my travel photo album by removing the background from my pictures.",
        "Instruction: Analyze the photo of the streets, categorize the elements presented in them such as people, cars, trees, and buildings, then tell me what is in the streets.",
        "Instruction: We have pictures of our city and we want to separate the buildings, roads, and trees. Generate optimized and segmented images with the appropriate model.",
        "Instruction: Analyze the following image and segment it into different regions based on the objects in it.",
        "Instruction: I upload my vacation photos and now I want to separate and label every object in my images.",
        "Instruction: I am doing a cityscape survey and I have a collection of drone images. I need to segment the images into different areas like roads, buildings, etc.",
        "Instruction: We need a segmentation model to label each pixel in an image with a specific category like person, dog, or cat.",
        "Instruction: I'd like to create a road navigation app that visualizes different parts of the road, such as lanes, pavement, and sidewalks. Can you help me parse these elements from a photo?",
        "Instruction: I want to find the edges of different objects in a given image so that we can understand their boundaries better.",
        "Instruction: An urban planning department needs an AI solution that can analyze satellite images for urban growth by segmenting different regions of interest.",
        "Instruction: In order to improve our interactive model, I want to segment the important piece(s) from an image using image segmentation.",
        "Instruction: I want to edit my photo, but don't know how to perfect the background removal, so I want an API to do it for me."
    ]
}